core/src/main/resources/order_template/modPCS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oed="http://tot.co.th/totom/interface/oedata" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
   <soapenv:Body>
      <oed:SubmitRequest>
         <OrderId>{3}</OrderId>
         <SourceSystemId>OMWeb</SourceSystemId>
         <OrderUserId>{7}</OrderUserId>
         <OrderDateTime>{6}</OrderDateTime>
         <OrderType>SUBMIT</OrderType>
         <OperationCode>MODPCS</OperationCode>
         <OrderItems>
            <OrderItem>
               <OrderItemType>ACCESS</OrderItemType>
               <OrderItemAction>MOD</OrderItemAction>
               <OrderItemId>ACCESSX{3}</OrderItemId>
               <OrderItemParentId/>
            </OrderItem>
            <OrderItem>
               <OrderItemType>MSISDN</OrderItemType>
               <OrderItemAction>REF</OrderItemAction>
               <OrderItemId>MSISDNX{3}</OrderItemId>
               <OrderItemParentId>ACCESSX{3}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>Number</Name>
                     <Value>{5}</Value>
                  </Attribute>
               </Attributes>
               <OrderItemCode/>
            </OrderItem>
            <OrderItem>
               <OrderItemType>SERVICE</OrderItemType>
               <OrderItemAction>{15}</OrderItemAction>
               <OrderItemId>SERVICEX{3}</OrderItemId>
               <OrderItemParentId>ACCESSX{3}</OrderItemParentId>
               <OrderItemCode/>
               <Attributes>
                  <Attribute>
                     <Name>ServiceId</Name>
                     <Value>PCS</Value>
                  </Attribute>
                  <Attribute>
                     <Name>pricingPlan</Name>
                     <Value>{4}</Value>
                  </Attribute>
                  <Attribute>
                     <Name>billingStartDate</Name>
                     <Value>{2}</Value>
                  </Attribute>
                  <Attribute>
                     <Name>totalQuota</Name>
                     <Value>{1}</Value>
                  </Attribute>
                  <Attribute>
                     <Name>usedQuota</Name>
                     <Value>{0}</Value>
                  </Attribute>
                  <Attribute>
                     <Name>billingDuration</Name>
                     <Value>{8}</Value>
                  </Attribute>
                  <Attribute>
                     <Name>refQoSProfName</Name>
                     <Value>{9}</Value>
                  </Attribute>
                  <Attribute>
                     <Name>billResetType</Name>
                     <Value>{10}</Value>
                  </Attribute>
                  <Attribute>
                     <Name>actionStatus</Name>
                     <Value>{11}</Value>
                  </Attribute>
                   <Attribute>
                     <Name>preferredDomain</Name>
                     <Value>{12}</Value>
                  </Attribute>
                  {13}                   
               </Attributes>
            </OrderItem>
            {14}
         </OrderItems>
      </oed:SubmitRequest>
   </soapenv:Body>
</soapenv:Envelope>